xmls/getIncomingTransaction_TouristSIT.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://webservice.nbc.org.kh/">
   <soapenv:Header/>
   <soapenv:Body>
      <web:getIncomingTransaction>
         <web:cm_user_name>rothtana</web:cm_user_name>
         <web:cm_password>P@ssw0rd</web:cm_password>
         <web:payee_participant_code>TOURKHPPXXX</web:payee_participant_code>
         <web:size>200</web:size>
      </web:getIncomingTransaction>
   </soapenv:Body>
</soapenv:Envelope>
