xmls/makeReverseTransaction_BakongRetail.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://webservice.nbc.org.kh/">
    <soapenv:Header/>
    <soapenv:Body>
        <web:makeReverseTransaction>
            <web:cm_user_name>soap1</web:cm_user_name>
            <web:cm_password>P@ssw0rd123</web:cm_password>
            <web:content_message>
                <![CDATA[
<Document xmlns="urn:iso:std:iso:20022:tech:xsd:pain.007.001.05" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <CstmrPmtRvsl>
        <GrpHdr>
            <MsgId>CRTACLBKHPPXXX092154</MsgId>
            <CreDtTm>2025-12-31T03:20:03.639Z</CreDtTm>
            <NbOfTxs>12</NbOfTxs>
            <DbtrAgt>
                <FinInstnId>
                    <BICFI>TOURKHPP</BICFI>
                </FinInstnId>
            </DbtrAgt>
            <CdtrAgt>
                <FinInstnId>
                    <BICFI>BKRTKHPP</BICFI>
                </FinInstnId>
            </CdtrAgt>
        </GrpHdr>
        <OrgnlGrpInf>
            <OrgnlMsgId>40cb600f850c47c5985d706aabc9d631</OrgnlMsgId>
            <OrgnlMsgNmId>pain.001.001.05</OrgnlMsgNmId>
            <OrgnlCreDtTm>2025-12-31T03:14:03.639Z</OrgnlCreDtTm>
        </OrgnlGrpInf>
        <OrgnlPmtInfAndRvsl>
            <OrgnlPmtInfId>TOURKHPPXXX/BKRTKHPPXXX/test4t</OrgnlPmtInfId>
            <TxInf>
                <RvslId>FT123456789</RvslId>
                <OrgnlInstdAmt Ccy="KHR">800</OrgnlInstdAmt>
                <RvsdInstdAmt Ccy="KHR">800</RvsdInstdAmt>
                <RvslRsnInf>
                    <Orgtr>
                        <Nm>NBCO</Nm>
                    </Orgtr>
                    <Rsn>
                        <Cd>GDDS</Cd>
                    </Rsn>
                </RvslRsnInf>
                <OrgnlTxRef>
                    <ReqdExctnDt>2025-12-31Z</ReqdExctnDt>
                    <Dbtr>
                        <Nm>NBCO</Nm>
                    </Dbtr>
                    <DbtrAcct>
                        <Id>
                            <Othr>
                                <Id>bkrtkhppxxx@bkrt</Id>
                            </Othr>
                        </Id>
                    </DbtrAcct>
                    <Cdtr>
                        <Nm>LOLC</Nm>
                    </Cdtr>
                </OrgnlTxRef>
            </TxInf>
        </OrgnlPmtInfAndRvsl>
    </CstmrPmtRvsl>
</Document>
]]>
            </web:content_message>
        </web:makeReverseTransaction>
    </soapenv:Body>
</soapenv:Envelope>
