xmls/getIncomingTransaction_BakongRetail.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://webservice.nbc.org.kh/">
   <soapenv:Header/>
   <soapenv:Body>
      <web:getIncomingTransaction> 
         <web:cm_user_name>soap1</web:cm_user_name> 
         <web:cm_password>P@ssw0rd123</web:cm_password>
         <web:payee_participant_code>BKRTKHPPXXX</web:payee_participant_code>
         <web:size>200</web:size>
      </web:getIncomingTransaction>
   </soapenv:Body>
</soapenv:Envelope>
