xmls/test-type1-pain007.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://webservice.nbc.org.kh/">
   <soapenv:Header/>
   <soapenv:Body>
      <web:makeReverseTransaction>
         <web:cm_user_name>bora</web:cm_user_name>
         <web:cm_password>B@ora123</web:cm_password>
         <web:content_message><![CDATA[<Document xmlns="urn:iso:std:iso:20022:tech:xsd:pain.007.001.05">
    <CstmrPmtRvsl>
        <GrpHdr>
            <MsgId>CRTTOURKHPPXXX1738266100111</MsgId>
            <CreDtTm>2026-01-30T17:21:40.111Z</CreDtTm>
            <NbOfTxs>1</NbOfTxs>
            <DbtrAgt>
                <FinInstnId>
                    <BICFI>TOURKHPPXXX</BICFI>
                </FinInstnId>
            </DbtrAgt>
            <CdtrAgt>
                <FinInstnId>
                    <BICFI>BKRTKHPPXXX</BICFI>
                </FinInstnId>
            </CdtrAgt>
        </GrpHdr>
        <OrgnlGrpInf>
            <OrgnlMsgId>ORIGINAL123456</OrgnlMsgId>
            <OrgnlMsgNmId>pain.001.001.05</OrgnlMsgNmId>
            <OrgnlCreDtTm>2026-01-30T17:15:00.000Z</OrgnlCreDtTm>
        </OrgnlGrpInf>
        <OrgnlPmtInfAndRvsl>
            <OrgnlPmtInfId>BKRTKHPPXXX/TOURKHPPXXX/8888888888</OrgnlPmtInfId>
            <TxInf>
                <RvslId>FT1738266100111</RvslId>
                <OrgnlInstdAmt Ccy="KHR">150000</OrgnlInstdAmt>
                <RvsdInstdAmt Ccy="KHR">150000</RvsdInstdAmt>
                <RvslRsnInf>
                    <Orgtr>
                        <Nm>TOURKHPPXXX</Nm>
                    </Orgtr>
                    <Rsn>
                        <Cd>GDDS</Cd>
                    </Rsn>
                </RvslRsnInf>
                <OrgnlTxRef>
                    <ReqdExctnDt>2026-01-30Z</ReqdExctnDt>
                    <Dbtr>
                        <Nm>TOURKHPPXXX</Nm>
                    </Dbtr>
                    <DbtrAcct>
                        <Id>
                            <Othr>
                                <Id>015039685739105</Id>
                            </Othr>
                        </Id>
                    </DbtrAcct>
                    <Cdtr>
                        <Nm>BKRTKHPPXXX</Nm>
                    </Cdtr>
                </OrgnlTxRef>
            </TxInf>
        </OrgnlPmtInfAndRvsl>
    </CstmrPmtRvsl>
</Document>]]></web:content_message>
      </web:makeReverseTransaction>
   </soapenv:Body>
</soapenv:Envelope>
